<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>PayloadContent</key>
    <array>
        <dict>
            <key>PayloadType</key>
            <string>com.apple.system.logging</string>
            <key>PayloadIdentifier</key>
            <string>sh.vibetunnel.logging.all</string>
            <key>PayloadUUID</key>
            <string>A7B8C9D0-1234-5678-9ABC-DEF012345678</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
            <key>PayloadDisplayName</key>
            <string>VibeTunnel Logging Configuration</string>
            <key>PayloadDescription</key>
            <string>Enables private data in logs for all VibeTunnel apps and components</string>
            <key>Subsystems</key>
            <dict>
                <!-- Main macOS app and all its components -->
                <key>sh.vibetunnel.vibetunnel</key>
                <dict>
                    <key>DEFAULT-OPTIONS</key>
                    <dict>
                        <key>Level</key>
                        <dict>
                            <key>Enable</key>
                            <string>Debug</string>
                            <key>Persist</key>
                            <string>Debug</string>
                        </dict>
                    </dict>
                </dict>
                <!-- macOS debug build -->
                <key>sh.vibetunnel.vibetunnel.debug</key>
                <dict>
                    <key>DEFAULT-OPTIONS</key>
                    <dict>
                        <key>Level</key>
                        <dict>
                            <key>Enable</key>
                            <string>Debug</string>
                            <key>Persist</key>
                            <string>Debug</string>
                        </dict>
                    </dict>
                </dict>
                <!-- macOS tests -->
                <key>sh.vibetunnel.vibetunnel.tests</key>
                <dict>
                    <key>DEFAULT-OPTIONS</key>
                    <dict>
                        <key>Level</key>
                        <dict>
                            <key>Enable</key>
                            <string>Debug</string>
                            <key>Persist</key>
                            <string>Debug</string>
                        </dict>
                    </dict>
                </dict>
                <!-- macOS tests debug -->
                <key>sh.vibetunnel.vibetunnel.tests.debug</key>
                <dict>
                    <key>DEFAULT-OPTIONS</key>
                    <dict>
                        <key>Level</key>
                        <dict>
                            <key>Enable</key>
                            <string>Debug</string>
                            <key>Persist</key>
                            <string>Debug</string>
                        </dict>
                    </dict>
                </dict>
                <!-- iOS app (main bundle ID) -->
                <key>sh.vibetunnel.vibetunnel-mobile</key>
                <dict>
                    <key>DEFAULT-OPTIONS</key>
                    <dict>
                        <key>Level</key>
                        <dict>
                            <key>Enable</key>
                            <string>Debug</string>
                            <key>Persist</key>
                            <string>Debug</string>
                        </dict>
                    </dict>
                </dict>
                <!-- iOS app (alternative bundle ID) -->
                <key>sh.vibetunnel.ios</key>
                <dict>
                    <key>DEFAULT-OPTIONS</key>
                    <dict>
                        <key>Level</key>
                        <dict>
                            <key>Enable</key>
                            <string>Debug</string>
                            <key>Persist</key>
                            <string>Debug</string>
                        </dict>
                    </dict>
                </dict>
                <!-- iOS tests -->
                <key>sh.vibetunnel.ios.tests</key>
                <dict>
                    <key>DEFAULT-OPTIONS</key>
                    <dict>
                        <key>Level</key>
                        <dict>
                            <key>Enable</key>
                            <string>Debug</string>
                            <key>Persist</key>
                            <string>Debug</string>
                        </dict>
                    </dict>
                </dict>
            </dict>
        </dict>
    </array>
    <key>PayloadIdentifier</key>
    <string>sh.vibetunnel.logging</string>
    <key>PayloadUUID</key>
    <string>C9D0E1F2-3456-7890-1CDE-F23456789012</string>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
    <key>PayloadDisplayName</key>
    <string>VibeTunnel Debug Logging</string>
    <key>PayloadDescription</key>
    <string>Enables full debug logging with private data visibility for VibeTunnel applications. Install this profile to see complete log details instead of &lt;private&gt; tags.</string>
    <key>PayloadOrganization</key>
    <string>VibeTunnel</string>
</dict>
</plist>